In [56]:
import pandas as pd

df = pd.read_csv('players_record.csv')

bow_paths = df.values[ : , -1 ]
bat_paths = df.values[ : , -2 ]

In [79]:
def get_data(path, seq_len): 
    df_ = pd.read_csv(path)
    
    test = ['-' for _ in range(seq_len)]
    odi  = ['-' for _ in range(seq_len)]
    t20  = ['-' for _ in range(seq_len)]
    ipl  = ['-' for _ in range(seq_len)]
    
    data = []
    
    for r in df_.values:    
        if (r[0] == 'Test'):
            test = r[1:]
        if (r[0] == 'ODI'):
            odi  = r[1:]
        if (r[0] == 'T20I'):
            t20  = r[1:]
        if (r[0] == 'IPL'):
            ipl  = r[1:]
    data = combine(test,odi,t20,ipl)
    return data


def combine(lst1, lst2 , lst3, lst4):  
    lst = []
    for _ in lst1:
        lst.append(_)
    for _ in lst2:
        lst.append(_)
    for _ in lst3:
        lst.append(_)
    for _ in lst4:
        lst.append(_)
    return lst

In [92]:
col_names = []
for i in ['Test','ODI','T20I','IPL']:
    for j in pd.read_csv('Scores/bow_1413.csv').columns[1:]:
        col_names.append('Bal_'  + i + '_' + j)

bow_data = []
for bow_path in bow_paths:  
    bow_data.append(get_data(bow_path, 12))
    
df_bow = pd.DataFrame(bow_data, columns = col_names)
df_bow.to_csv('Ball_Career.csv', index = False)

### 2. Batting Data

In [93]:
col_names = []
for i in ['Test','ODI','T20I','IPL']:
    for j in pd.read_csv('Scores/bat_1413.csv').columns[1:]:
        col_names.append('Bat_' + i + '_' + j)
        
bat_data = []

for bat_path in bat_paths:  
    bat_data.append(get_data(bat_path,13))
    
    
df_bat = pd.DataFrame(bat_data, columns = col_names)
df_bat.to_csv('Bat_Career.csv', index = False)

### 3. Combining the Dataset

In [94]:
df_1 = pd.read_csv('players_record.csv')
df_2 = pd.read_csv('Bat_Career.csv')
df_3 = pd.read_csv('Ball_Career.csv')

In [101]:
df = pd.DataFrame()
df = pd.concat((df_1,df_2,df_3), axis = 1)

del df['link']
del df['bat_path']
del df['bow_path']

df.to_csv('data.csv', index = False)

### 4. Data Analysis

In [157]:
srt = []

for i in df['Bat_ODI_M']:
    if ( i != '-' ):
        srt.append(int(i))
        
df[df['Bat_ODI_M'] == str(max(srt))]

,name,team,date_of_birth,palce_of_birth,role,height,test_bat_rank,odi_bat_rank,t20_bat_rank,test_bow_rank,...,Bal_IPL_B,Bal_IPL_Runs,Bal_IPL_Wkts,Bal_IPL_BBI,Bal_IPL_BBM,Bal_IPL_Econ,Bal_IPL_Avg,Bal_IPL_SR,Bal_IPL_5W,Bal_IPL_10W
84,Chris Gayle,West Indies,"Sep 21, 1979 (43 years)","Kingston, Jamaica",Batsman,--,--,--,--,--,...,554,729,18,3/21,3/21,7.9,40.5,30.78,0,0

In [158]:
df.values[0]

array(['Virat Kohli', 'India', 'Nov 05, 1988 (34 years)', 'Delhi',
       'Batsman', '5 ft 9 in (175 cm)', '11', '10', '13', '--', '--',
       '--', '102', '173', '10', '8074', '254', '49.53', '14499', '55.69',
       '27', '7', '28', '910', '24', '264', '255', '39', '12358', '183',
       '57.21', '13317', '92.8', '43', '0', '64', '1161', '126', '115',
       '107', '31', '4008', '122', '52.74', '2905', '137.97', '1', '0',
       '37', '356', '117', '223', '215', '32', '6624', '113', '36.2',
       '5129', '129.15', '5', '0', '44', '578', '218', '102', '11', '175',
       '84', '0', '0/0', '0/0', '2.88', '0.0', '0.0', '0', '0', '264',
       '48', '641', '665', '4', '1/15', '1/15', '6.22', '166.25',
       '160.25', '0', '0', '115', '13', '152', '204', '4', '1/13', '1/13',
       '8.05', '51.0', '38.0', '0', '0', '223', '26', '251', '368', '4',
       '2/25', '2/25', '8.8', '92.0', '62.75', '0', '0'], dtype=object)

In [ ]:
[]